import json
def replace_non_ascii_chars(string):
    char_mapping = {
        'ā': 'a', 'ū': 'u', 'Ḩ': 'H', 'ī': 'i', 'ō': 'o', 'ē': 'e', 'ḏ': 'd', 'Ā': 'A', 'ṯ': 't',
        'Ş': 'S', 'ḩ': 'h', 'ṟ': 'r', 'ç': 'c', 'ë': 'e', 'Ç': 'C', 'ï': 'i', 'â': 'a', 'é': 'e',
        'û': 'u', 'è': 'e', 'à': 'a', 'á': 'a', 'í': 'i', 'ú': 'u', 'ñ': 'n', 'ó': 'o', 'ä': 'a',
        'ß': 'ss', 'ö': 'o', 'ü': 'u', 'ğ': 'g', 'ş': 's', 'ı': 'i', 'İ': 'I', 'É': 'E', 'č': 'c',
        'ć': 'c', 'ž': 'z', 'Č': 'C', 'Ć': 'C', 'đ': 'd', 'š': 's', 'Ž': 'Z', 'Š': 'S', 'ô': 'o',
        'ê': 'e', 'õ': 'o', 'Ó': 'O', 'ŭ': 'u', 'ŏ': 'o', 'ă': 'a', 'ĭ': 'i', 'Ŏ': 'O', 'ĕ': 'e',
        'ǫ': 'o', '̀': '', 'Î': 'I', 'Ú': 'U', 'Đ': 'D', 'ý': 'y', 'Ý': 'Y', 'ě': 'e', 'ř': 'r',
        'ň': 'n', 'ů': 'u', 'Ř': 'R', 'ď': 'd', 'ť': 't', 'Å': 'A', 'ø': 'o', 'æ': 'ae', 'å': 'a',
        'Ø': 'O', 'Æ': 'AE', 'Ḏ': 'D', 'ţ': 't', 'Ţ': 'T', 'ṭ': 't', 'Ḥ': 'H', 'Ä': 'A', 'î': 'i',
        'È': 'E', 'ő': 'o', 'Ő': 'O', 'ð': 'd', 'Þ': 'TH', 'þ': 'th', 'Ẕ': 'z', 'Ṭ': 'T', 'ḥ': 'h',
        'ṣ': 's', 'ù': 'u', 'ì': 'i', 'Ō': 'O', 'Ū': 'U', 'Ô': 'O', 'ņ': 'n', 'ķ': 'k', 'ģ': 'g',
        'Ē': 'E', 'ļ': 'l', 'Ķ': 'K', 'ė': 'e', 'ų': 'u', 'ż': 'z', 'ġ': 'g', 'ħ': 'h', 'Ħ': 'H',
        'ċ': 'c','Ġ': 'G', 'Ż': 'Z', 'ș': 's', 'ț': 't', 'З': 'Z', 'у': 'u', 'н': 'n', 'м': 'm',
        'ṅ': 'n', 'ḍ': 'd', '̇': '', 'Ŭ': 'U', 'А': 'A', 'а': 'a', 'ч': 'ch', 'в': 'v', 'Ч': 'Ch',
        'е': 'e', 'С': 'S', 'И': 'I', 'з': 'z', 'Ј': 'J', 'л': 'l', 'К': 'K', 'ц': 'c', 'п': 'p',
        'П': 'P', 'Р': 'R', 'ш': 'sh', 'Н': 'N', 'г': 'g', 'ł': 'l', 'ś': 's', 'ń': 'n', 'ą': 'a',
        'ę': 'e', 'ź': 'z', 'Ł': 'L', 'Ś': 'S', 'Ș': 'S', 'Ț': 'T', 'Đ': 'D', 'ľ': 'l', 'Ľ': 'L',
        'Ĺ': 'L', 'Ò': 'O', 'À': 'A', '·': '.', 'Б': 'B', 'Đ': 'D', 'ễ': 'e', 'ừ': 'u', 'ỗ': 'o',
        'ế': 'e', 'ể': 'e', 'ồ': 'o', 'ậ': 'a', 'ẽ': 'e', 'ỉ': 'i','ẖ':'h','ẕ':'z'
        }
    char_mapping.update({
        'Á': 'A', 'Â': 'A', 'Í': 'I', 'Ó': 'O', 'Ñ': 'N', 'Ö': 'O', 'Ü': 'U',
        'â': 'a', 'ã': 'a', 'ầ': 'a', 'ấ': 'a', 'ẩ': 'a', 'ẫ': 'a', 'ậ': 'a',
        'ố': 'o', 'ồ': 'o', 'ổ': 'o', 'ỗ': 'o', 'ộ': 'o', 'ớ': 'o', 'ờ': 'o', 'ỡ': 'o', 'ợ': 'o',
        'á': 'a', 'è': 'e', 'é': 'e', 'ê': 'e', 'ë': 'e', 'ì': 'i', 'í': 'i', 'î': 'i', 'ï': 'i',
        'ý': 'y', 'ĩ': 'i', 'ỹ': 'y', 'ú': 'u', 'ù': 'u', 'û': 'u', 'ü': 'u', 'ũ': 'u', 'ụ': 'u',
        'ư': 'u', 'ứ': 'u', 'ừ': 'u', 'ử': 'u', 'ữ': 'u', 'ự': 'u', 'ằ': 'a', 'ẳ': 'a', 'ẵ': 'a',
        'ỉ': 'i', 'ẻ': 'e', 'ẽ': 'e', 'ỏ': 'o', 'ố': 'o', 'ồ': 'o', 'ổ': 'o', 'ỗ': 'o', 'ộ': 'o',
        'ặ': 'a', 'ẹ': 'e', 'ẽ': 'e', 'ễ': 'e', 'ể': 'e', 'ễ': 'e', 'ở': 'o', 'ộ': 'o', 'ợ': 'o',
        'ớ': 'o', 'ỡ': 'o', 'ã': 'a', 'è': 'e', 'õ': 'o', 'ỳ': 'y', 'ằ': 'a', 'ệ': 'e', 'ỹ': 'y',
        'ā': 'a', 'ē': 'e', 'ī': 'i', 'ō': 'o', 'ū': 'u', 'Ā': 'A', 'Ē': 'E', 'Ī': 'I', 'Ō': 'O',
        'Ū': 'U','H̱':'H',    'ò': "o",
    'Ə': "E",
    'ə': "e",
    'О': "O",
    'т': "t",
    'б': "b",
    'р': "p",
    'с': "c",
    'и': "i",
    'й': "y",
    'ÿ': "y",
    'ḯ': "i",
    'ḑ': "d",
    'о': "o",
    'д': "d",
    'Ð': "D",
    'ơ': "o",
    'ị': "i",
    'ắ': "a",
    'ạ': "a",
    'Ấ': "A",
    'ủ': "u",
    'ả': "a",
    'ọ': "o",
    'ề': "e",
    }) 
    for char in char_mapping:
        print(f"Replacing: {char}")
        string=string.replace(char, char_mapping[char])
    return string

print("reading...")

with open('resources\cities.json',mode='r',encoding='utf8') as f:
    text=f.read()
print('writing..')
text=replace_non_ascii_chars(text)
data = json.loads(text)
for city in data:
    city['name']=city['name'].title()
    city['country_name']=city['country_name'].title()
with open('resources\cities.json',mode='w',encoding='utf8') as f:
    json.dump(data,f,indent=4,ensure_ascii=False)

print('done.')